//⦁	На всеки четен етаж има само офиси
//⦁	На всеки нечетен етаж има само апартаменти
//⦁	Всеки апартамент се означава по следния начин : А{номер на етажа}{ номер на апартамента}, номерата на апартаментите започват от 0.
//⦁	Всеки офис се означава по следния начин : О{номер на етажа}{ номер на офиса}, номерата на офисите също започват от 0.
//⦁	На последният етаж винаги има апартаменти и те са по-големи от останалите, за това пред номера им пише 'L', вместо 'А'. Ако има само един етаж, то има само големи апартаменти!
//От конзолата се прочитат две цели числа - броят на етажите и броят на стаите за един етаж.
int floors = int.Parse(Console.ReadLine());
int rooms = int.Parse(Console.ReadLine());

for (int floor = floors; floor >= 1; floor--)
{
    char symbol;
    if (floor == floors)
    {
        symbol = 'L';
    }
    else if (floor % 2 == 0)
    {
        symbol = 'O';
    }
    else
    {
        symbol = 'A';
    }

    for (int room = 0; room < rooms; room++)
    {
        Console.Write($"{symbol}{floor}{room} ");

    }
    Console.WriteLine(); 
}

